[
    {
        "isbn": 60853980,
        "title": "Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch",
        "image_url": "https://d.gr-assets.com/books/1392528568m/12067.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1392528568s/12067.jpg",
        "num_pages": 413,
        "description": "&amp;lt;p&amp;gt;According to&amp;lt;em&amp;gt;The Nice and Accurate Prophecies of Agnes Nutter&amp;lt;/em&amp;gt;,&amp;lt;em&amp;gt;Witch&amp;lt;/em&amp;gt;&amp;&#35;40;the world&apos;s only&amp;lt;em&amp;gt;completely&amp;lt;/em&amp;gt;accurate book of prophecies, written in 1655, before she exploded&amp;&#35;41;, the world will end on a Saturday. Next Saturday, in fact. Just before dinner.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;So the armies of Good and Evil are amassing, Atlantis is rising, frogs are falling, tempers are flaring. Everything appears to be going according to Divine Plan. Except a somewhat fussy angel and a fast-living demon—both of whom have lived amongst Earth&apos;s mortals since The Beginning and have grown rather fond of the lifestyle—are not actually looking forward to the coming Rapture.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;And someone seems to have misplaced the Antichrist . . .&amp;lt;/p&amp;gt;",
        "average_rating": 4.27
    },
    {
        "isbn": "055215430X",
        "title": "Night Watch",
        "image_url": "https://d.gr-assets.com/books/1320518310m/47989.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1320518310s/47989.jpg",
        "num_pages": 480,
        "description": "&amp;lt;em&amp;gt;&apos;Don't put your trust in revolutions. They always come round again. That's why they're called revolutions. People die, and nothing changes.'&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;For a policeman, there can be few things worse than a serial killer at loose in your city. Except, perhaps, a serial killer who targets coppers, and a city on the brink of bloody revolution. The people have found their voice at last, the flags and barricades are rising...And the question for a policeman, an officer of the law, adefender of the peace, is:&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Are you with them, or are you against them?",
        "average_rating": 4.44
    },
    {
        "isbn": 60012382,
        "title": "The Wee Free Men &amp;&#35;40;Discworld, #30&#41; (Tiffany Aching, #1)",
        "image_url": "https://d.gr-assets.com/books/1284280817m/34494.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1284280817s/34494.jpg",
        "num_pages": 375,
        "description": "&amp;lt;em&amp;gt;&quot;Another world is colliding with this one,\" said the toad. \"All the monsters are coming back.\"&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&quot;Why?\" said Tiffany.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&quot;There&apos;s no one to stop them.\"&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;There was silence for a moment.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Then Tiffany said, &quot;There&apos;s me.\"&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Armed only with a frying pan and her common sense, Tiffany Aching, a young witch-to-be, is all that stands between the monsters of Fairyland and the warm, green Chalk country that is her home. Forced into Fairyland to seek her kidnapped brother, Tiffany allies herself with the Chalk&apos;s local Nac Mac Feegle - aka the Wee Free Men - a clan of sheep-stealing, sword-wielding, six-inch-high blue men who are as fierce as they are funny. Together they battle through an eerie and ever-shifting landscape, fighting brutal flying fairies, dream-spinning dromes, and grimhounds - black dogs with eyes of fire and teeth of razors - before ultimately confronting the Queen of the Elves, absolute ruler of a world in which reality intertwines with nightmare. And in the final showdown, Tiffany must face her cruel power alone....&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;In a riveting narrative that is equal parts suspense and humor, Carnegie Medalist Terry Pratchett returns to his internationally popular Discworld with a breathtaking tale certain to leave fans, new and old, enthralled.",
        "average_rating": 4.22
    },
    {
        "isbn": 61020664,
        "title": "Wyrd Sisters &amp;&#35;40;Discworld, #6&#41;",
        "image_url": "https://d.gr-assets.com/books/1275974472m/34504.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1275974472s/34504.jpg",
        "num_pages": 265,
        "description": "Witches are not by nature gregarious, and they certainly don&apos;t have leaders. Granny Weatherwax was the most highly-regarded of the leaders they didn't have. But even she found that meddling in royal politics was a lot more difficult than certain playwrights would have you believe...",
        "average_rating": 4.06
    },
    {
        "isbn": 552152951,
        "title": "Reaper Man &amp;&#35;40;Discworld, #11&#41;",
        "image_url": "https://d.gr-assets.com/books/1389211958m/34517.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1389211958s/34517.jpg",
        "num_pages": {},
        "description": "&amp;lt;em&amp;gt;&apos;Death has to happen. Tha'ts what bein' alive is all about. You're alive, and then you're dead. It can't just stop happening.'&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;But it can. And it has. So what happens after death is now less of a philosophical question than a question of actual reality. On the disc, as here, they need Death. If Death doesn&apos;t come for you, then what are you supposed to do in the meantime? You can't have the undead wandering about like lost souls. There's no telling what might happen, particularly when they discover that life really is only for the living...",
        "average_rating": 4.23
    },
    {
        "isbn": 552154288,
        "title": "Hogfather &amp;&#35;40;Discworld, #20&#41;",
        "image_url": "https://d.gr-assets.com/books/1327948141m/34532.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1327948141s/34532.jpg",
        "num_pages": 432,
        "description": "&amp;lt;em&amp;gt;Susan had never hung up a stocking . She&apos;d never put a tooth under her pillow in the serious expectation that a dentally inclined fairy would turn up. It wasn't that her parents didn't believe in such things. They didn't&amp;lt;/em&amp;gt;need&amp;lt;em&amp;gt;to believe in them. They know they existed. They just wished they didn&apos;t.&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;em&amp;gt;&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;There are those who believe and those who don&apos;t. Through the ages, superstition has had its uses. Nowhere more so than in the Discworld where it's helped to maintain the status quo. Anything that undermines superstition has to be viewed with some caution. There may be consequences, particularly on the last night of the year when the time is turning. When those consequences turn out to be the end of the world, you need to be prepared. You might even want more standing between you and oblivion than a mere slip of a girl - even if she has looked Death in the face on numerous occasions...",
        "average_rating": 4.16
    },
    {
        "isbn": 552153257,
        "title": "Feet of Clay &amp;&#35;40;Discworld, #19&#41;",
        "image_url": "https://d.gr-assets.com/books/1320490628m/34527.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1320490628s/34527.jpg",
        "num_pages": 416,
        "description": "&amp;lt;em&amp;gt;&apos;Sorry?' said Carrot. If it's just a thing, how can it commit murder? A sword is a thing' - he drew his own sword; it made an almost silken sound - 'and of course you can't blame a sword if someone thrust it at you, sir.'&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;For members of the City Watch, life consists of troubling times, linked together by periods of torpid inactivity. Now is one such troubling time. People are being murdered, but there&apos;s no trace of anything alive having been at the crime scene. Is there ever a circumstance in which you can blame the weapon not the murderer? Such philosophical questions are not the usual domain of the city's police, but they're going to have to start learning fast...",
        "average_rating": 4.2
    },
    {
        "isbn": 552152676,
        "title": "Thud! &amp;&#35;40;Discworld, #34&#41;",
        "image_url": "https://d.gr-assets.com/books/1320495268m/62530.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1320495268s/62530.jpg",
        "num_pages": 439,
        "description": "Koom Valley? That was where the trolls ambushed the dwarfs, or the dwarfs ambushed the trolls. It was far away. It was a long time ago.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;But if he doesn&apos;t solve the murder of just one dwarf, Commander Sam Vimes of Ankh-Morpork City Watch is going to see it fought again, right outside his office.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;With his beloved Watch crumbling around him and war-drums sounding, he must unravel every clue, outwit every assassin and brave any darkness to find the solution. And darkness is&amp;lt;em&amp;gt;following&amp;lt;/em&amp;gt;him.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Oh . . . and at six o&apos;clock every day, without fail, with no excuses, he must go home to read 'Where's My Cow?', with all the right farmyard noises, to his little boy.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;There are some things you&amp;lt;em&amp;gt;have&amp;lt;/em&amp;gt;to do.",
        "average_rating": 4.23
    },
    {
        "isbn": "055255264X",
        "title": "A Hat Full of Sky &amp;&#35;40;Discworld, #32&#41;",
        "image_url": "https://d.gr-assets.com/books/1319037274m/34501.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1319037274s/34501.jpg",
        "num_pages": 352,
        "description": {},
        "average_rating": 4.25
    },
    {
        "isbn": {
            "nil": true
        },
        "title": "Monstrous Regiment",
        "image_url": "https://d.gr-assets.com/books/1375908503m/34511.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1375908503s/34511.jpg",
        "num_pages": 496,
        "description": "War has come to Discworld . . . again.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;And, to no one&apos;s great surprise, the conflict centers on the small, insufferably arrogant, strictly fundamentalist duchy of Borogravia, which has long prided itself on it's ability to beat up on its neighbors for even the tiniest imagined slight. This time, however, it's Borogravia that's getting its long overdue comeuppance, which has left the country severely drained of young men.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Ever since her brother Paul marched off to battle a year ago, Polly Perks has been running The Duchess, her family&apos;s inn -- even though the revered national deity Nuggan has decreed that female ownership of a business is an Abomination &amp;&#35;40;with, among others, oysters, rocks, and the color blue&#41;. To keep The Duchess in the family, Polly must find her missing sibling. So she cuts off her hair, dons masculine garb, and sets out to join him in this man's army.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Despite her rapid mastery of belching, scratching, and other macho habits &amp;&#35;40;and aided by a well-placed pair of socks&#41;, Polly is afraid that someone will immediately see through her disguise; a fear that proves groundless when the recruiting officer, the legendary and seemingly ageless Sergeant Jackrum, accepts her without question. Or perhaps the sergeant is simply too desperate for fresh cannon fodder to discriminate -- which would explain why a vampire, a troll, a zombie, a religious fanatic, and two uncommonly close &quot;friends\" are also eagerly welcomed into the fighting fold. But marching off with little (read: no) training, Polly (now called \"Oliver\") finds herself wondering about the myriad peculiarities of her new brothers-in-arms. It would appear that Polly \"Ozzer\" Perks is not the only grunt with a secret. There is no time to dwell on such matters, however.Duty calls. The battlefield beckons. There&apos;s a tide to be turned.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;And sometimes -- in war as in everything else -- the best man for the job is a woman.",
        "average_rating": 4.12
    },
    {
        "isbn": 552154229,
        "title": "The Fifth Elephant &amp;&#35;40;Discworld, #24&#41;",
        "image_url": "https://d.gr-assets.com/books/1327961702m/63720.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1327961702s/63720.jpg",
        "num_pages": 464,
        "description": "They say that diplomacy is a gentle art. That its finest practitioners are subtle, sophisticated individuals for whom nuance and subtext are meat and drink. And that mastering it is a lifetime&apos;s work. But you&amp;lt;em&amp;gt;do&amp;lt;/em&amp;gt;need a certain inclination in that direction. It&apos;s not something you can just pick up on the job.&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;Which is a shame if you find yourself dropped unaccountably into a position of some significant diplomatic responsibility. If you don&apos;t really&amp;lt;em&amp;gt;do&amp;lt;/em&amp;gt;diplomacy or haven&apos;t been to school with the right foreign bigwigs or aren't even sure whether a nod is as good as a wink to anyone, sighted or otherwise, then things are likely to go wrong. It's just a question of how badly...",
        "average_rating": 4.17
    },
    {
        "isbn": 552144320,
        "title": "Men at Arms: The Play",
        "image_url": "https://d.gr-assets.com/books/1353573652m/7557548.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1353573652s/7557548.jpg",
        "num_pages": 182,
        "description": "In this latest &amp;#35;1 international bestseller, the hilarious and twisted author of Soul Music delivers readers once again into Discworld. Since the captain of the City Watch has left the force to become a gentleman, Discworld is in search of a few good cops. And being a cop in this unpredictable universe is no easy job, so the search goes on for a few good trolls, dwarves, and such.",
        "average_rating": 4.38
    },
    {
        "isbn": 552152943,
        "title": "Moving Pictures &amp;&#35;40;Discworld, #10&#41;",
        "image_url": "https://d.gr-assets.com/books/1320456553m/34510.jpg",
        "small_image_url": "https://d.gr-assets.com/books/1320456553s/34510.jpg",
        "num_pages": 396,
        "description": "&amp;lt;em&amp;gt;&apos;Holy wood is a different sort of place. People act differently here. Everywhere else the most important things are gods or money or cattle. Here, the most important thing is to be important.'&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;em&amp;gt;&amp;lt;/em&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;People might say that reality is a quality that things possess in the same way that they possess weight. Sadly alchemists never really held with such a quaint notion. They think that they can change reality, shape it to their own purpose. Imagine then the damage that could be wrought if they get their hands on the ultimate alchemy: the invention of motion pictures, the greatest making of illusions. It may be a triumph of universe-shaking proportions. It&apos;s either that or they're about to unlock the dark terrible secret of the Holy Wood hills - by mistake...",
        "average_rating": 3.85
    }
]
